<!DOCTYPE html>
<html>
<head>
    <title>รายชื่อนักเรียนห้อง 6/10 - Foreach Loop</title>
</head>
<body>
    <h1>รายชื่อนักเรียนห้อง 6/10 - Foreach Loop</h1>
    <ul>
        <?php
        $students = [
            "นายชยางกูร ขำเถื่อน", "นายไชยวัฒน์ มิตรานนท์", "นายวโรดม กุนเรือง","นายอภิวิชญ์ ชนะชล", "นายชานนท์ ชาวชายโขง", "นายนพดล ละดาดก", "นายชินกฤช ธนกรณ์กุล",
            "นายพงศ์ภรณ์ สุนทรานุรักษ์", "นายพรเทพ เอมอมร", "นายวรชัย เจนจบวิทยา", "นายสรวิชญ์ สิทธิบวรสกุล",
            "นายไชยวัฒน์ จัดเจนนาวี", "นายวงศ์วริศ ชัยกุลประดิษฐ์", "นายคณิศร ศักดิ์ทอง", "นายธนวัฒน์ ลบช้าง",
            "นายแทนไท จันทร์ขจร", "นายปรัญชัย เพชรแสงโรจน์", "นายพัทธดนย์ สุวรรณรัตน์", "นายสัณหณัฐ ครองธรรมศิริ",
            "นายจิรภัทร ภูบรรทัด", "นายจิรานุวัฒน์ ขันธ์นิตย์", "นายสิปปกร จันทร์พุ่ม", "นายอชิรวัตติ์ ศรีรัตนาม",
            "นายปณิทัศน์ แซ่เจียม", "นายกันตพัฒน์ โตใหญ่", "นายชุติเดช เทิดสถิตบุญฤทธิ์", "นายวชิรวิชญ์ ตะเภาทอง",
            "นายพุฒิเกียรติ แก้วกล้า", "นายศุภโชค ปิยเจริญสิทธิ", "นางสาวสุภาวิตา บุญโภคอุดม", "นางสาวพิมพ์ชนก สุขนุ่ม",
            "นางสาววรณัน บุหงาเกษมสุข", "นางสาวอภิชญา ตะโกจีน", "นางสาวนัทธมน วชิรสุดเลขา", "นางสาวสิรินดา อยู่เมฆ",
            "นางสาวปภาดา เหลืองประภา", "นางสาวณัฐชา เท้าสมบุญ", "นางสาวธัญชนก สุดธง", "นางสาวกัญญวรา สายโส",
            "นางสาวนภัสสร กิจจารักษ์" 
        ];
        
        foreach ($students as $index => $student) {
            echo "<li>เลขที่ " . ($index + 1) . " : " . $student . "</li>";
        }
        ?>
    </ul>
</body>
</html>
